[
  {
    "id": "phenixbb_2024_001",
    "question": "Hi Phenixbb, We would appreciate your advice regarding an odd problem that has cropped up with one of our crystal structures. We have a protein structure in space group P6(3)22 at 2.1 A resolution and in the final refinement stages with Rwork of 0.20 and Rfree of 0.22. When we ran simulated annealing to rebuild an outlier Lysine residue in a loop, the Sim Omit map showed the positive density expected from the omission of the loop (contour level 3 sigma, colored green in attached pics). However, flanking the positive density, there is a complimentary negative density (in red). We are puzzled as to the cause of the appearance of the negative density. Can you help us?"
  },
  {
    "id": "phenixbb_2024_002",
    "question": "what happened to Molprobity"
  },
  {
    "id": "phenixbb_2024_003",
    "question": "After Pheneix refine, the quality of the structure improved significantly as analyzed by Molprobity. However the bond deviation increased significantly after the refinement. Will you please tell me which refine function can be used to reduce the bond deviation detected by the Coot geometry analysis?"
  },
  {
    "id": "phenixbb_2024_016",
    "question": "Hi, i am working on a structure where I have a few relatively big red blobs (please see attached print screens with maps at 1.2 and 3.5 rmsd). The data were processed at BESSY, mtz was used in Phaser and refined in phenix.refine. Can someone explain why this happens (and whether it is an issue)?"
  },
  {
    "id": "phenixbb_2024_017",
    "question": "I'm trying to understand the current status of joint X-ray/neutron refinement in phenix.refine. The announcement of the latest release mentions a change in the algorithm as described in the recent publication."
  },
  {
    "id": "phenixbb_2024_018",
    "question": "Dear all, I have highly anisotropic data. I was able to solve the structure by MR, and refine it with phenix.refine to Rwork/Rfree=0.28/0.31 with Resolution cutoff 2.64Å and mean B values 114, which is pretty high for such resolution. Though the overall structure makes sense, the maps are quite featureless, no water molecules, and side-chains refinement is a problem. I have tested how the data is anisotropic with Diffraction Anisotropy Server which shows clearly, that we don't really have data to 2.64Å in all directions. I would like to know if it's possible to use Phenix with some more advance parameters to actually address the issue of anisotropy and to get maximum out of the data."
  },
  {
    "id": "phenixbb_2024_019",
    "question": "My data-processing gives me strange results. Use xia2 with XDS. "
  },
  {
    "id": "phenixbb_2024_020",
    "question": "Hello, I would appreciate some insights on how to interpret the validation results under the CaBLAM tab and how to use it to fix my structure in Coot? What are the CaBLAM score, the Ca geometry score, the helix score and the 3-10 score? How to use the information under the secondary structure tab? In my protein for example, I see a lot of 'try beta sheets', should I try to refine that segment using beta sheets restraints?"
  },
  {
    "id": "phenixbb_2024_021",
    "question": "I have run phenix.resolve_cryo_em using half maps at 7.5 A resolution (the postprocessed map is at 7.1 A) and I just wanted to clarify a couple of things. I set the resolution to 7.52 A but didn't supply a resolution for density modification - it seems to have chosen a value of 5.671 A. It states 'Estimated improvement of -0.450 A to d_min(FSCref=0.5): 6.628 A' suggesting to me that it agrees with the postprocessed resolution. What resolution should I supply to RSR if I use the density modified map?"
  },
  {
    "id": "phenixbb_2024_022",
    "question": "I have a 3.7 Angs cryo-EM reconstructed structure for a virus capsid and we have been able to build a model for the capsid VP using COOT. I would like to refine this model further against the map using real space refinement. I am trying to find a suitable program that would allow me to do this. I believe Phenix can do it, but I am not sure. Could you give me some direction?"
  },
  {
    "id": "phenixbb_2024_023",
    "question": "I am trying to use phenix.map_to_model to generate a model just using my cryo-EM map (mrc format) and a fasta sequence. My protein has octahedral symmetry. I found the use_space_group_symmetry argument but am not sure what argument to give to impose the symmetry. Also, I have the pdb of the asymmetric unit and I am trying to fit it into my cryo-EM map of the whole structure (which has octahedral symmetry). Do I have to do some sort of pdb manipulation before the model_to_map operation?"
  },
  {
    "id": "phenixbb_2024_024",
    "question": "General strategies: I select COOT for the model building; using phenix.real_sapce_refine for the real space refinement with secondary structure restrain and REFMAC for the reciprocal space refinement. Few questions are listed here: 1. The map was too bigger to open it in COOT. The phenix.map_to_structure_factors was used to obtaine ~120 MB sized MTZ file (still a little big for my computer). I manually build up the whole ball-shaped phage with the rigid body fit in COOT (from two X-ray structures to 120 chains). In this case, should I crop the map in Chimera or other software and only focus on a small asymmetric unit to do the model building?"
  },
  {
    "id": "phenixbb_2024_025",
    "question": "Maybe I'm doing it wrong, but I was trying to show a class last week how to use the AlphaFold features of phenix, only to find that the Colab seems to no longer exist? I know the dedicated server is up now, but the current stable release does not have that feature in the GUI. Will a new stable release be released soon?"
  },
  {
    "id": "phenixbb_2024_026",
    "question": "In crystallography we can look at difference maps. Is there a similar tool for cryoEM?"
  },
  {
    "id": "phenixbb_2024_027",
    "question": "I collected two datasets of the same ligand bound structure at 2.4 and 2.1 Å resolution. The apo structure has already been solved to 2.2Å resolution in P31 (and P3121 for SeMet). After processing each dataset as both P31 and P3121 in MOSFLM, I proceeded with MR with Phaser using sequential partial search models to place either 3 copies in the ASU for P3121, or 6 copies for P31. My concern is that there is some pathology that is not being recognized (merohedral twinning) or that the NCS/pseudosymmetry is not being addressed appropriately. The R/Rfree values are hung up at ~0.42/0.46."
  },
  {
    "id": "phenixbb_2024_028",
    "question": "I did SAD phasing with Co sites and with AutoSol I got a partial model, that I then edited. However, since you were suggesting the phases should be better when you combine those from the model with the experimental ones I ran Phaser-EP in SAD-MR mode. I have provided the model I edited after AutoSol, my HA sites, and the data, and I got a better map than even just with AutoSol!!! Is it a good solution if the FOM is 0.49 and LLG is 36449.63 after Phaser?"
  },
  {
    "id": "phenixbb_2024_029",
    "question": "I have collected a high redundancy dataset on our bruker home-source to get good anomalous data to confirm if a ligand bound near the active site is really the one I think. If I do MR with phaser-MR a solution is found easily. If I then continue with MR-SAD the program does not give me a solution. No file named overall_best.pdb is present in the output directory. Warnings: FOM < 0.05 ... skipping solution 1. However Autosol with extreme density modification and Iterate substructure search is able to solve the structure. Will the MTZ file (phases) produced from MR-SAD always be better (compared to SAD or MR alone) because it will contain phases that combine the information from both the MR model and the SAD data?"
  },
  {
    "id": "phenixbb_2024_030",
    "question": "Dear developers I have a dataset to about 4 A in point group P 4 2 2 (Pointless suggests P 41 21 2). The protein is about 11 kDa and has an identity of about 50% to my search model. Phaser calculated the eLLG to be about 5, and maybe not surprisingly, it failed even after using Sculptor to prepare the model. It also says that solutions with Z-scores more than 8 were rejected for failing the packing test. Solvent content calculation from Xtriage suggests about 8 copies in the asu. Would this be of any help in MR?"
  },
  {
    "id": "phenixbb_2024_031",
    "question": "I'm sorry, part of the problem is that autosol exptl_fobs_phases_freeR_flags_1.mtz file does not retain the anomalous information. So in your case the best thing is to run phenix.refine with your original mtz file. You can create a freeR set in the GUI. My problem is that when I try to define the 11 remaining sites for the 'refine anomalous groups' selection the software complains: Invalid combination: F-obs not anomalous, but refinement of 11 f_double_prime values requested."
  },
  {
    "id": "phenixbb_2024_032",
    "question": "We have a new method to do that in a development version of Phaser, which should become part of the official release at some point in the not so distant future. This is part of some wider work to adapt Phaser's algorithms for real space molecular replacement to work better in the cryo-EM docking problem. So far, the magnification factor refinement seems to be pretty robust in our tests. Is there a method to refine the pixel size of an image reconstruction if the PDB has been docked in?"
  },
  {
    "id": "phenixbb_2024_033",
    "question": "I really like the idea of CaBLAM validate for model validation at low resolution based on the CA and backbone geometry, but the output is a little limiting - either text or kinemage right now. Would it be possible to create an output format that can easily be visualized (and turned into figures) in chimera, pymol or coot? Maybe a modified version of the input pdb with the CA/peptide outlier status mapped to the B-factor and occupancy columns?"
  },
  {
    "id": "phenixbb_2024_034",
    "question": "I have a very minor problem with partial occupancy waters moving out of density during refinement. I have 2 structures, one apo structure (~1.3Å), one ligand bound (~1.5Å). The ligand binding site contains a Calcium ion. In the apo form there are 2 waters coordinating this Calcium. In the ligand bound form, these waters are replaced by oxygen atoms within the ligand. However, the ligand is only at 0.5 Occupancy as part of the ligand lies on a crystallographic two-fold axis. So I added 2 0.5 occupancy waters to the model at these positions."
  },
  {
    "id": "phenixbb_2024_035",
    "question": "Hi, I just started learning crystallography months ago, and the software I used most is XDS, HKL2000, phenix and coot. Now I am working on a series of datasets-----the same target protein with various ligands. The following is my refinement workflow: 1, Processing data with XDS (or HKL2000 for some of the datasets) 2,Molecule replacement with phaser. 3,Check and modify the structure residue by residue with COOT, 4,phenix.refine with the following command line: phenix.refine protein.1.mtz protein.pdb strategy=individual_sites+individual_sites_real_space+individual_adp+tls simulated_annealing=true."
  },
  {
    "id": "phenixbb_2024_004",
    "question": "I run into this problem when I tried to refine my protein structure after adding ligand. The ligand that I am adding is a malonate, and the 3-letter chemical code is MLI. I add the ligand using Coot and it fit perfectly into the electron density map. I then tried to run phenix.refine by giving the protein structure pdb file, the original mtz file and the protein sequence fasta file. However, there was an error message saying missing restraints for the ligand. So I generate the CIF file for the ligand using the Ready Set icon in the toolbar. The ligand CIF file and a updated protein structure pdb file was generated and automatically added to the refinement windows. However, when I run the refinement, I saw this error message: Number of nonbonded interaction distances <0.001:2. Please inspect the output above (or in the log window) and correct the input model file. When I inspect the log window, the error is due to the oxygen atoms in the ligand being too close to each other. Why is there an error if the ligand was generated automatically in Phenix?"
  },
  {
    "id": "phenixbb_2024_005",
    "question": "In my latest installed version of phenix, I find that additional, redundant map coefficients are being added to the output mtz file. When running refinement via the command-line with the 'write_maps=true' keyword, I get many additional columns like 2FOFCWT_1, PH2FOFCWT_1, etc. These mtz column labels are not automatically recognized and I find it confusing. It would be nice to have a workaround and get the same output as when using phenix 1.20."
  },
  {
    "id": "phenixbb_2024_006",
    "question": "I have recently started using PHENIX so I am a beginer in PHENIX field. I am getting better statistics (Rfactor/Rfree) as compared to REFMAC so having strong inclination to continue with PHENIX but there are some discripancies I found when comparing with CCP4 programs. When going for AutoBuild afterwards it uses output pdb (MR.1.pdb) which is fine but uses MR.1.mtz as map coefficient. Shouldnot it uses original mtz from scala? Same in Phenix.refine when going after Autobuild finishes and it asks for refining the model it uses same AutoMR output mtz (MR.1.mtz). As I was suggested by many that we should use original mtz coming from scala for Refinement to reduce model bias."
  },
  {
    "id": "phenixbb_2024_007",
    "question": "I got an error message when I try to refine a molecular replacement result. It says Fatal problems interpreting model file: Number of atoms with unknown nonbonding energy type symbols: 18. Please edit the model file to resolve the problems and/or supply a CIF file with restraints."
  },
  {
    "id": "phenixbb_2024_008",
    "question": "problem launching Phenix 1.21.1-5286 under Debian 12 Linux"
  },
  {
    "id": "phenixbb_2024_009",
    "question": "what to change on the subsequent def file to point to the desired input pdb after phenix.refine command line"
  },
  {
    "id": "phenixbb_2024_010",
    "question": "I'm running autobuild from a molecular replacement solution and having two problems: 1. methionines are converted to MSE 2. I'd like to include a .cif file for b-mercapto-ethanol adducted cysteines: CME. The .cif file is one that works for phenix.refine. I suspect I am not writing the .eff file correctly."
  },
  {
    "id": "phenixbb_2024_011",
    "question": "The structure factors that I downloaded from the PDB for my little MR project contains both reflections behind the beam stop and reflections of higher resolution than even the original authors would use. When setting up the MR I entered the more restrictive resolution limits into the Wizard and Phaser appears to have obeyed. As near as I can tell from the log files, however, Resolve is using all the data in the rebuild. I would prefer that only data between 30 and 2.2A were used but it is clear that the refinement is, at least, monitoring the fit to all the data."
  },
  {
    "id": "phenixbb_2024_012",
    "question": "How exactly is Wilson B-factor for phenix header calculated and would it be possible to output there also the average B-factor of all the atoms in the structure?"
  },
  {
    "id": "phenixbb_2024_013",
    "question": "I used the 'real space refinement' to refine my protein-ligand complex. The cif file got from 'real space refinement' was put into 'Prepare model for PDB depositon' and then I used 'Get PDB validation report' to see the validation report. It's a pity I got the following error message from 'Get PDB validation report': The PDB server reports a failure with you data. Please check that your input files following the CIF specifications. However, if I use the cif file from phenix.refine with the same procedure, I got the validation reports normally."
  },
  {
    "id": "phenixbb_2024_014",
    "question": "I am trying to generate an isomorphous difference map with phenix GUI. I input reflection 1 and 2 with mtz format and a PDB model, I got an MTZ format map file. Because I want to load it to coot or pymol with negative and positive density, I need to transform this mtz map to ccp4 map. However, FFT map cannot work. Does any know how can I get a ccp4 format maps with positive or negative density?"
  },
  {
    "id": "phenixbb_2024_015",
    "question": "I clicked on automatically add hydrogens to model and got this error message: refinement.pdb_interpretation.clash_guard.failure: Number of nonbonded interaction distances <0.5:391. I suppose that this comes, because coot mixes up the hydrogens."
  }
]